Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetActiveDrawing Method
 Returns an instance of the active drawing that is currently open in Tekla Structures.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Drawing GetActiveDrawing()
Public Function GetActiveDrawing As Drawing
Return Value
Type: Drawing
The drawing that is open in Tekla Structures or null if no drawing is open.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace